Sonair-AS/mcupsdk-core-k3/examples/drivers/boot/sbl_ospi/am275x-evm/wkup-r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM275x" --part "AM2754" --package "ANJ" --context "wkup-r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM2754" --package "FCCSP (ANJ)" --context "wkup-r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.21.0+3721"}
 */

/**
 * Import the modules used in this configuration.
 */
const flash       = scripting.addModule("/board/flash/flash", {}, false);
const flash1      = flash.addInstance();
const bootloader  = scripting.addModule("/drivers/bootloader/bootloader", {}, false);
const bootloader1 = bootloader.addInstance();
const bootloader2 = bootloader.addInstance();
const bootloader3 = bootloader.addInstance();
const bootloader4 = bootloader.addInstance();
const bootloader5 = bootloader.addInstance();
const bootloader6 = bootloader.addInstance();
const gtc         = scripting.addModule("/drivers/gtc/gtc");
const uart        = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1       = uart.addInstance();
const debug_log   = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7   = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71  = mpu_armv7.addInstance();
const mpu_armv72  = mpu_armv7.addInstance();
const mpu_armv73  = mpu_armv7.addInstance();
const mpu_armv74  = mpu_armv7.addInstance();
const mpu_armv75  = mpu_armv7.addInstance();
const mpu_armv76  = mpu_armv7.addInstance();
const mpu_armv77  = mpu_armv7.addInstance();
const mpu_armv78  = mpu_armv7.addInstance();
const mpu_armv79  = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
bootloader1.appImageOffset = "0x400000";
bootloader1.$name          = "CONFIG_BOOTLOADER_R50_0";

bootloader2.$name          = "CONFIG_BOOTLOADER_R50_1";
bootloader2.appImageOffset = "0x800000";

bootloader3.$name          = "CONFIG_BOOTLOADER_R51_0";
bootloader3.appImageOffset = "0xC00000";

bootloader4.$name          = "CONFIG_BOOTLOADER_R51_1";
bootloader4.appImageOffset = "0x1000000";

bootloader5.$name          = "CONFIG_BOOTLOADER_C750";
bootloader5.appImageOffset = "0x1400000";

bootloader6.$name          = "CONFIG_BOOTLOADER_C751";
bootloader6.appImageOffset = "0x1800000";

bootloader1.flashDriver                                        = flash1;
flash1.$name                                                   = "CONFIG_FLASH_SBL";
bootloader2.flashDriver                                        = flash1;
bootloader3.flashDriver                                        = flash1;
bootloader4.flashDriver                                        = flash1;
bootloader5.flashDriver                                        = flash1;
bootloader6.flashDriver                                        = flash1;
flash1.serialFlashDriver.$name                                 = "board_flash_serialFlash_serialflash0";
flash1.serialFlashDriver.peripheralDriver.dllLockMode          = "HALF_CYCLE_LOCK";
flash1.serialFlashDriver.peripheralDriver.txDllLowWindowStart  = 28;
flash1.serialFlashDriver.peripheralDriver.txDllLowWindowEnd    = 48;
flash1.serialFlashDriver.peripheralDriver.txDllHighWindowStart = 60;
flash1.serialFlashDriver.peripheralDriver.txDllHighWindowEnd   = 96;
flash1.serialFlashDriver.peripheralDriver.rxLowSearchEnd       = 40;
flash1.serialFlashDriver.peripheralDriver.rxHighSearchStart    = 24;
flash1.serialFlashDriver.peripheralDriver.rxHighSearchEnd      = 107;
flash1.serialFlashDriver.peripheralDriver.txLowSearchStart     = 16;
flash1.serialFlashDriver.peripheralDriver.txLowSearchEnd       = 64;
flash1.serialFlashDriver.peripheralDriver.txHighSearchStart    = 78;
flash1.serialFlashDriver.peripheralDriver.txHighSearchEnd      = 127;
flash1.serialFlashDriver.peripheralDriver.txDLLSearchOffset    = 8;
flash1.serialFlashDriver.peripheralDriver.rdDelayMin           = 1;
flash1.serialFlashDriver.peripheralDriver.rdDelayMax           = 4;
flash1.serialFlashDriver.peripheralDriver.rxTxDLLSearchStep    = 4;
flash1.serialFlashDriver.peripheralDriver.$name                = "CONFIG_OSPI_SBL";
flash1.serialFlashDriver.peripheralDriver.OSPI.$assign         = "OSPI0";

uart1.$name             = "CONFIG_UART_SBL";
uart1.addedByBootloader = true;
uart1.intrEnable        = "DISABLE";
uart1.UART.$assign      = "UART0";

debug_log.enableUartLog                      = true;
debug_log.enableCssLog                       = false;
debug_log.uartTrace                          = true;
debug_log.uartLog.hwFlowControl              = true;
debug_log.uartLog.intrEnable                 = "DISABLE";
debug_log.uartLog.$name                      = "CONFIG_UART_APP";
debug_log.uartLog.useWakeupDomainPeripherals = true;

mpu_armv71.size         = 31;
mpu_armv71.attributes   = "Device";
mpu_armv71.allowExecute = false;
mpu_armv71.$name        = "CONFIG_MPU_REGISTER";

mpu_armv72.size       = 15;
mpu_armv72.$name      = "CONFIG_MPU_TCMA";
mpu_armv72.attributes = "NonCached";

mpu_armv73.baseAddr   = 0x41010000;
mpu_armv73.size       = 15;
mpu_armv73.$name      = "CONFIG_MPU_TCMB";
mpu_armv73.attributes = "NonCached";

mpu_armv74.$name    = "HSRAM";
mpu_armv74.baseAddr = 0x43C00000;
mpu_armv74.size     = 19;

mpu_armv75.$name    = "OCMC_RAM";
mpu_armv75.size     = 20;
mpu_armv75.baseAddr = 0x72000000;

mpu_armv76.baseAddr     = 0x5C00000;
mpu_armv76.size         = 16;
mpu_armv76.attributes   = "NonCached";
mpu_armv76.allowExecute = false;
mpu_armv76.$name        = "CONFIG_MPU_SOC_TCMA";

mpu_armv77.size         = 8;
mpu_armv77.attributes   = "Device";
mpu_armv77.allowExecute = false;
mpu_armv77.$name        = "FSS1_OSPI0_CTRL_BASE";
mpu_armv77.baseAddr     = 0xFC40000;

mpu_armv78.size         = 27;
mpu_armv78.attributes   = "Device";
mpu_armv78.allowExecute = false;
mpu_armv78.baseAddr     = 0x60000000;
mpu_armv78.$name        = "FSS0_DAT_REG1_BASE";

mpu_armv79.baseAddr     = 0x2800000;
mpu_armv79.size         = 9;
mpu_armv79.$name        = "UART0_REG";
mpu_armv79.attributes   = "Device";
mpu_armv79.allowExecute = false;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.serialFlashDriver.peripheralDriver.OSPI.CLK.$suggestSolution  = "OSPI0_CLK";
flash1.serialFlashDriver.peripheralDriver.OSPI.CSn0.$suggestSolution = "OSPI0_CSn0";
flash1.serialFlashDriver.peripheralDriver.OSPI.DQS.$suggestSolution  = "OSPI0_DQS";
flash1.serialFlashDriver.peripheralDriver.OSPI.D7.$suggestSolution   = "OSPI0_D7";
flash1.serialFlashDriver.peripheralDriver.OSPI.D6.$suggestSolution   = "OSPI0_D6";
flash1.serialFlashDriver.peripheralDriver.OSPI.D5.$suggestSolution   = "OSPI0_D5";
flash1.serialFlashDriver.peripheralDriver.OSPI.D4.$suggestSolution   = "OSPI0_D4";
flash1.serialFlashDriver.peripheralDriver.OSPI.D3.$suggestSolution   = "OSPI0_D3";
flash1.serialFlashDriver.peripheralDriver.OSPI.D2.$suggestSolution   = "OSPI0_D2";
flash1.serialFlashDriver.peripheralDriver.OSPI.D1.$suggestSolution   = "OSPI0_D1";
flash1.serialFlashDriver.peripheralDriver.OSPI.D0.$suggestSolution   = "OSPI0_D0";
uart1.UART.RXD.$suggestSolution                                      = "MCASP4_AXR0";
uart1.UART.TXD.$suggestSolution                                      = "MLB0_MLBCLK";
debug_log.uartLog.WKUP_UART.$suggestSolution                         = "WKUP_UART";
debug_log.uartLog.WKUP_UART.RXD.$suggestSolution                     = "WKUP_UART0_RXD";
debug_log.uartLog.WKUP_UART.TXD.$suggestSolution                     = "WKUP_UART0_TXD";
debug_log.uartLog.WKUP_UART.RTSn.$suggestSolution                    = "WKUP_UART0_RTSn";
debug_log.uartLog.WKUP_UART.CTSn.$suggestSolution                    = "WKUP_UART0_CTSn";
